[
  {
    "id": "non-linear-pricing-with-maximum-demand",
    "title": "Non-linear Pricing with Maximum Demand (JMP)",
    "link": "papers/JMP.pdf",
    "type": "working",
    "authors": [],
    "presentedAt": "",
    "journal": "",
    "abstract": "We revisit non-linear pricing with a parsimonious yet empirically grounded departure: each consumer has a maximum demand, a finite quantity beyond which marginal utility is zero. This addresses two major limitations in the literature. First, the standard prediction of strictly positive marginal prices with quantity discounts explains neither the prevalence of all-you-can-eat pricing (zero marginal price) in subscription models and unlimited passes, nor the quantity premiums commonly used in utility markets, parcel shipping, and cloud storage. In our model, both can arise as optimal. Second, the ubiquitous single-crossing assumption, which precludes any rank change in marginal utilities across types as quantity changes, is restrictive. Consumer preferences in our model go beyond this assumption and we provide a method to solve the problem. The optimal mechanism can feature full consumer surplus extraction, all-you-can-eat pricing and non-monotonic allocation. These features persist for broader preferences that violate single-crossing, beyond the maximum demand specification. In particular, monopoly may over-provide, overturning standard intuition. Finally, we show that a quantity premium (discount) is optimal under perfect positive (negative) correlation and this result extends to more general forms of stochastic dependence. "
  },
  {
    "id": "the-optimal-design-of-countervailing-incentives",
    "title": "The Optimal Design of Countervailing Incentives",
    "link": "papers/Countervailing Incentives.pdf",
    "type": "working",
    "authors": [],
    "presentedAt": "",
    "journal": "",
    "abstract": "Countervailing incentives – like the incentives faced by a shareholder to name a price that acts both as the selling price of their existing stocks and the purchase price of other shareholders’ stocks – are pervasive in mechanism and market design. Leveraging these countervailing incentives can make the truthful elicitation of a market participant’ valuations easier. We develop a unified framework for optimal mechanism design that explicitly accounts for countervailing incentives and provide a constructive algorithm to compute the optimal mechanism. The algorithm also enables empirical estimation of the designer’s welfare weight by matching model-implied allocations to observed outcomes. The framework yields new insights: the optimal mechanism features a quantity premium; cooperative production generates higher designer surplus than in standard exchange platform models; and optimal credible threats (uniformly worse outside options) can raise some market participants’ worst-case payoffs."
  },
  {
    "id": "control-a-conversation",
    "title": "Control a Conversation (Slides coming soon)",
    "link": "",
    "type": "wip",
    "authors": ["Martino Banchio, Andrés Perlroth"],
    "presentedAt": "",
    "journal": "",
    "abstract": ""
  },
  {
    "id": "control-a-conversation",
    "title": "Product Differentiation and Competition",
    "link": "",
    "type": "wip",
    "authors": ["Gagan Aggarwal, Andrés Perlroth"],
    "presentedAt": "",
    "journal": "",
    "abstract": ""
  },
  {
    "id": "the-biggar-dwl",
    "title": "The Biggar DWL (Draft available upon request)",
    "link": "",
    "type": "wip",
    "authors": ["Simon Loertscher"],
    "presentedAt": "EARIE 2024",
    "journal": "",
    "abstract": "Analysing otherwise standard monopoly and oligopoly models in which consumers’investments improve product quality, we show that the effects of market power on consumer and social surplus easily dwarf those in models without investments. Pro-hibiting mergers that are profitable once investments are sunk can be Pareto improving because, under Cournot oligopoly, industry and per-firm profit before investment need not be maximized at monopoly. Price ceilings inhibiting profit maximization ex post can increase everyone’s welfare by creating commitment firms with market power lack. Accounting for consumers’ investment incentives also opens scope for socially deficient free entry and, thereby, for industrial policy."
  },
  {
    "id": "externalities-efficiency-and-partitioned-vcg-mechanisms",
    "title": "Externalities, efficiency, and partitioned VCG mechanisms (Draft available upon request)",
    "link": "",
    "type": "wip",
    "authors": ["Simon Loertscher"],
    "presentedAt": "Asian School in Economic Theory Keio University in Tokyo 2023, the Connections Workshop: Mathematics and Computer Science of Market and Mechanism Design 2023 at UC Berkeley,the 2024 Conference on Mechanism and Institution Design in Budapest, Games 2024 at Peking University",
    "journal": "",
    "abstract": "Externalities, while relevant in the real world, are, according to common practice, not accounted for in market design. This paper shows when the common practice is justified even though externalities matter for the eﬃcient allocation of resources and derives the direct mechanisms that allocate eﬃciently, endow the agents with dominant strategies, respect their individual rationality constraint and minimize their communicative requirements. These mechanisms and standard auction formats like the second-price auction are part of a family of mechanisms that we call partitioned VCG mechanism. In such a mechanism, each agent bids on all elements in a partition of a subset of the feasible allocations. The coarsest partitioned VCG consistent with eﬃciency minimizes the agents’ communicative requirements. It can be implemented in undominated strategies with a two-stage mechanism in which in the first stage each agent selects the partition it wants to bid on. Consequently, the designer does not need to know the agents’ preference structure to allocate eﬃciently in the presence of externalities."
  },
  {
    "id": "efficient-consignment-auction",
    "title": "Efficient Consignment Auction",
    "link": "https://direct.mit.edu/rest/article-abstract/doi/10.1162/rest_a_01389/117908/Efficient-Consignment-Auctions?redirectedFrom=fulltext",
    "type": "publication",
    "authors": ["Simon Loertscher, Leslie M. Marx"],
    "presentedAt": "",
    "journal": "The Review of Economics and Statistics",
    "abstract": "Consignment auctions are two-stage mechanisms to (re)-allocate emission permits. Firms are first endowed with permits and then allowed to trade them. We determine theoretically endowments that enable efficient allocation, subject to incentive compatibility, individual rationality, and no deficit. All firms prefer efficient consignment auctions to efficient standard auctions, making them politically palatable. Firms' investment incentives align with the first-best in efficient consignment auctions. Grandfathering based on efficient long-run allocations induces efficiency-permitting endowments. A simple calibration to data from Southern California's RECLAIM program validates our no-deficit assumption and shows that grandfathering provides the best theoretical match for the empirically observed endowments."
  }
]
